<!-- dflook/terraform-github-actions {"workspace":"tofu-release-2","backend_type":"remote","backend":"23b0365b01ff2785518bc56eaad47d7917302e4bfc951bf89213189729a62e6b","plan_job_ref":"Job Test Terraform cloud #185 at https://github.com/dflook/terraform-github-actions/actions/runs/6645076671","plan_hash":"8f058efd5f77faff055272c987cabe85c570784daaec9bd4680d2d1ac85e7322","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __tofu-release-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #185](https://github.com/dflook/terraform-github-actions/actions/runs/6645076671)